0hJonny/epd-lilygo-badge/sdkconfig.defaults
# ============================================================
# Project defaults - LILYGO T5-4.7-S3 (rev V2.4)
#
# Derived from a verified working sdkconfig. The build system never
# modifies this file; it generates sdkconfig from these values on a
# clean checkout.
#
# The build does NOT overwrite values already present in sdkconfig.
# After changing anything here, delete sdkconfig and rebuild.
#
# Options omitted below keep their ESP-IDF defaults.
# ============================================================

CONFIG_IDF_TARGET="esp32s3"

# ------------------------------------------------------------
# Flash - ESP32-S3-WROOM-1-N16R8, 16 MB in DIO mode
# ------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE_DETECT=y

# ------------------------------------------------------------
# Partition table
#
# Custom layout: partitions.csv MUST be present in the project root
# and tracked in git. The default single-app layout does not fit
# this firmware - LVGL plus the embedded OTF font exceed 1 MB.
# ------------------------------------------------------------
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ------------------------------------------------------------
# PSRAM - 8 MB octal, mandatory
#
# Frame buffers total roughly 1.3 MB: 518 KB LVGL render buffer,
# 518 KB rotation scratch, 260 KB EPD output. Without PSRAM the
# first heap_caps_malloc fails and the firmware aborts at startup.
# ------------------------------------------------------------
CONFIG_ESP32S3_SPIRAM_SUPPORT=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# ------------------------------------------------------------
# CPU frequency - 80 MHz
#
# E-ink redraw time is dominated by panel physics, not by the CPU,
# so the low clock costs nothing perceptible and cuts active-phase
# current.
#
# Note this is the ESP32S3_ prefix, not ESP_DEFAULT_ - the generic
# symbol does not exist for this target in ESP-IDF 4.4.
#
# Consequence: heavy software rendering paths are three times slower
# than at 240 MHz. LV_RADIUS_CIRCLE masks in particular can starve
# the idle task and trip the task watchdog - see user_profile.h.
# ------------------------------------------------------------
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_80=y
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_MHZ=80

# ------------------------------------------------------------
# Power management
#
# Powering down the CPU and tag memory during light sleep is what
# makes the idle-loop savings real. Flash and PSRAM stay powered,
# so the frame buffers survive.
# ------------------------------------------------------------
CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=y
CONFIG_PM_POWER_DOWN_TAGMEM_IN_LIGHT_SLEEP=y

# ------------------------------------------------------------
# Console
#
# USB Serial/JTAG does not survive light sleep: the peripheral stops
# with the CPU and the host may reset the board. To debug power
# management, switch to UART0 on IO43/IO44 with an external adapter.
# ------------------------------------------------------------
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# ------------------------------------------------------------
# Watchdogs - stock values, listed because the sleep loop depends
# on them.
#
# Both idle tasks are monitored with a 5 s timeout. The display task
# calls vTaskDelay(1) before each light sleep specifically to feed
# the core 1 idle task; light sleep is not a scheduler block.
# ------------------------------------------------------------
CONFIG_ESP_TASK_WDT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

# ------------------------------------------------------------
# FreeRTOS
#
# 100 Hz tick: vTaskDelay(1) in the sleep loop yields for 10 ms,
# negligible against the 150 ms sleep slice.
# ------------------------------------------------------------
CONFIG_FREERTOS_HZ=100

# ============================================================
# LVGL 9.5
# ============================================================

CONFIG_LV_CONF_SKIP=y

# ------------------------------------------------------------
# Color depth
#
# 1-bit is the panel's native model, but the render format is set
# to L8 at runtime in initLvgl(), so software L8 support must stay
# enabled - epd_flush_cb packs L8 down to the panel's 4bpp.
# ------------------------------------------------------------
CONFIG_LV_COLOR_DEPTH_1=y
CONFIG_LV_DRAW_SW_SUPPORT_L8=y

CONFIG_LV_USE_DRAW_SW=y
CONFIG_LV_DRAW_SW_COMPLEX=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=1
CONFIG_LV_DRAW_BUF_STRIDE_ALIGN=1
CONFIG_LV_DRAW_BUF_ALIGN=4

# LVGL heap for widgets and styles. Every lv_obj_set_style_* call
# allocates from here.
CONFIG_LV_MEM_SIZE_KILOBYTES=128

CONFIG_LV_OS_NONE=y

# ------------------------------------------------------------
# Fonts
#
# Montserrat 14 is required: it is the default font and the only
# source of LV_SYMBOL_* glyphs. The rotate button in the status bar
# renders LV_SYMBOL_LOOP from it. Disabling this leaves the button
# blank.
#
# UI text uses the embedded OTF via tiny_ttf instead - see
# embedded_assets.h.
# ------------------------------------------------------------
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_14=y
CONFIG_LV_USE_FONT_PLACEHOLDER=y
CONFIG_LV_TXT_ENC_UTF8=y

# ------------------------------------------------------------
# Required widgets and features
# ------------------------------------------------------------
CONFIG_LV_USE_LABEL=y
CONFIG_LV_USE_BUTTON=y
CONFIG_LV_USE_IMAGE=y
CONFIG_LV_USE_QRCODE=y
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_USE_FLEX=y

# Glyph cache for tiny_ttf. Japanese text needs a larger cache than
# Latin; lowering this trades RAM for re-rasterisation on every
# redraw.
CONFIG_LV_TINY_TTF_CACHE_GLYPH_CNT=128
CONFIG_LV_TINY_TTF_CACHE_KERNING_CNT=256

# Monochrome theme - the only one that makes sense on this panel.
CONFIG_LV_USE_THEME_MONO=y

# ------------------------------------------------------------
# Disabled to save flash
#
# The upstream defaults build LVGL's examples and demos into the
# image. Nothing here references them.
# ------------------------------------------------------------
# CONFIG_LV_BUILD_EXAMPLES is not set
# CONFIG_LV_BUILD_DEMOS is not set